package defpackage;

import com.yandex.go.eboks.objects.a;
import java.util.Locale;
import org.json.JSONObject;
import ru.CryptoPro.JCSP.api.bio.CspBioProgressConstants;

/* loaded from: classes11.dex */
public abstract class f2a1 {
    public static final String[] a = {"❤️", "💛️", "💚️", "💙️", "💜️", "🖤️", "💔️", "❣️", "💕️", "💞️", "💓️", "💗️", "💖️", "💘️", "💝️", "💟️", "☮️", "✝️", "☪️", "🕉️", "☸️", "✡️", "🔯️", "🕎️", "☯️", "☦️", "🛐️", "⛎️", "♈️", "♉️", "♊️", "♋️", "♌️", "♍️", "♎️", "♏️", "♐️", "♑️", "♒️", "♓️", "🆔️", "⚛️", "🉑️", "☢️", "☣️", "📴️", "📳️", "🈶️", "🈚️", "🈸️", "🈺️", "🈷️", "✴️", "🆚️", "💮️", "🉐️", "㊙️", "㊗️", "🈴️", "🈵️", "🈹️", "🈲️", "🅰️", "🅱️", "🆎️", "🆑️", "🅾️", "🆘️", "❌️", "⭕️", "🛑️", "⛔️", "📛️", "🚫️", "💯️", "💢️", "♨️", "🚷️", "🚯️", "🚳️", "🚱️", "🔞️", "📵️", "🚭️", "❗️", "❕️", "❓️", "❔️", "‼️", "⁉️", "🔅️", "🔆️", "〽️", "⚠️", "🚸️", "🔱️", "⚜️", "🔰️", "♻️", "✅️", "🈯️", "💹️", "❇️", "✳️", "❎️", "🌐️", "💠️", "Ⓜ️", "🌀️", "💤️", "🏧️", "🚾️", "♿️", "🅿️", "🈳️", "🈂️", "🛂️", "🛃️", "🛄️", "🛅️", "🚹️", "🚺️", "🚼️", "🚻️", "🚮️", "🎦️", "📶️", "🈁️", "🔣️", "ℹ️", "🔤️", "🔡️", "🔠️", "🆖️", "🆗️", "🆙️", "🆒️", "🆕️", "🆓️", "0⃣️", "1⃣️", "2⃣️", "3⃣️", "4⃣️", "5⃣️", "6⃣️", "7⃣️", "8⃣️", "9⃣️", "🔟️", "🔢️", "#⃣️", "*⃣️", "▶️", "⏸️", "⏯️", "⏹️", "⏺️", "⏭️", "⏮️", "⏩️", "⏪️", "⏫️", "⏬️", "◀️", "🔼️", "🔽️", "➡️", "⬅️", "⬆️", "⬇️", "↗️", "↘️", "↙️", "↖️", "↕️", "↔️", "↪️", "↩️", "⤴️", "⤵️", "🔀️", "🔁️", "🔂️", "🔄️", "🔃️", "🎵️", "🎶️", "➕️", "➖️", "➗️", "✖️", "💲️", "💱️", "™️", "©️", "®️", "〰️", "➰️", "➿️", "🔚️", "🔙️", "🔛️", "🔝️", "🔜️", "✔️", "☑️", "🔘️", "⚪️", "⚫️", "🔴️", "🔵️", "🔺️", "🔻️", "🔸️", "🔹️", "🔶️", "🔷️", "🔳️", "🔲️", "▪️", "▫️", "◾️", "◽️", "◼️", "◻️", "⬛️", "⬜️", "🔈️", "🔇️", "🔉️", "🔊️", "🔔️", "🔕️", "📣️", "📢️", "👁️\u200d🗨️", "💬️", "🗨️", "💭️", "🗯️", "♠️", "♣️", "♥️", "♦️", "🃏️", "🎴️", "🀄️", "🕐️", "🕑️", "🕒️", "🕓️", "🕔️", "🕕️", "🕖️", "🕗️", "🕘️", "🕙️", "🕚️", "🕛️", "🕜️", "🕝️", "🕞️", "🕟️", "🕠️", "🕡️", "🕢️", "🕣️", "🕤️", "🕥️", "🕦️", "🕧️", "⚕"};

    public static jge0 a(JSONObject jSONObject) {
        return new jge0(jSONObject.getInt("capacity"), jSONObject.getInt("min"), jSONObject.getInt(CspBioProgressConstants.MAX));
    }

    public static a b(fn6 fn6Var) {
        return new a(fn6Var);
    }

    public static final String c(char c) {
        String valueOf = String.valueOf(c);
        Locale locale = Locale.ROOT;
        String upperCase = valueOf.toUpperCase(locale);
        if (upperCase.length() <= 1) {
            return String.valueOf(Character.toTitleCase(c));
        }
        if (c == 329) {
            return upperCase;
        }
        return upperCase.charAt(0) + upperCase.substring(1).toLowerCase(locale);
    }
}
